---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalCurveSelector.WholeCurve
enum: Autodesk.Revit.DB.Structure.AnalyticalCurveSelector
source: html/52eafef1-198c-a2d8-ebc3-615e96b6fbbb.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalCurveSelector.WholeCurve

Entire curve.